docs/notes/jq.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>jq</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/main.css" />
</head>
<body>
<div id="preamble" class="status">
<nav id="navbar" class="cf">
  <ul class="cf">
    <li class="fl">
      <a href="/">cfclrk</a>
    </li>
    <li class="fr">
      <a href="/articles/home.html">Articles</a>
    </li>
    <li class="fr">
      <a href="/notes/home.html">Notes</a>
    </li>
	<li class="fr">
      <a href="/cloudformation/home.html">CloudFormation</a>
    </li>
  </ul>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">jq</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org08188ac">Period in Key</a></li>
<li><a href="#org7b64c34">Multiline</a></li>
<li><a href="#org788227e">Variable as Argument</a></li>
<li><a href="#orge21fd31">Select</a>
<ul>
<li><a href="#orgb3aa0f4">Name Contains</a></li>
<li><a href="#org43e5d91">Name Starts With</a></li>
</ul>
</li>
<li><a href="#orgba2e275">AWS Resources with Tag</a>
<ul>
<li><a href="#orgdc76ddd">Use <code>aws --filter</code></a></li>
</ul>
</li>
<li><a href="#orgf7683d2">Sorting</a></li>
<li><a href="#orgfd726d8">Stringify JSON</a></li>
</ul>
</div>
</nav>

<div id="outline-container-org08188ac" class="outline-2">
<h2 id="org08188ac"><a href="#org08188ac">Period in Key</a></h2>
<div class="outline-text-2" id="text-org08188ac">
<pre class="example" id="org694eba4">
{
    "apiVersion": "v1",
    "data": {
        "tls.crt": "Zm9vCg==",
        "tls.key": "YmFyCg=="
    },
    "kind": "Secret",
    "type": "kubernetes.io/tls"
}
</pre>

<div class="org-src-container">
<pre class="src src-bash">echo $KubeSecret | jq -r '.data["tls.crt"]'
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b64c34" class="outline-2">
<h2 id="org7b64c34"><a href="#org7b64c34">Multiline</a></h2>
<div class="outline-text-2" id="text-org7b64c34">
<div class="org-src-container">
<pre class="src src-sh">echo $GithubRelease \
    | jq '.assets[]
          | select(.name == "py-demo-Darwin-x86_64")
          | .name'
</pre>
</div>
</div>
</div>

<div id="outline-container-org788227e" class="outline-2">
<h2 id="org788227e"><a href="#org788227e">Variable as Argument</a></h2>
<div class="outline-text-2" id="text-org788227e">
<div class="org-src-container">
<pre class="src src-sh">echo $GithubRelease \
    | jq --arg name "py-demo-Darwin" \
         '.assets[]
          | select(.name | startswith($name))
          | .name'
</pre>
</div>
</div>
</div>

<div id="outline-container-orge21fd31" class="outline-2">
<h2 id="orge21fd31"><a href="#orge21fd31">Select</a></h2>
<div class="outline-text-2" id="text-orge21fd31">
</div>
<div id="outline-container-orgb3aa0f4" class="outline-3">
<h3 id="orgb3aa0f4"><a href="#orgb3aa0f4">Name Contains</a></h3>
<div class="outline-text-3" id="text-orgb3aa0f4">
<pre class="example" id="org712504f">
[
  {"name": "This is item1"},
  {"name": "This is item2"},
  {"name": "item3"}
]
</pre>

<div class="org-src-container">
<pre class="src src-sh">echo $Items \
    | jq -c '.[] | select(.name | contains("item2"))'
</pre>
</div>
</div>
</div>

<div id="outline-container-org43e5d91" class="outline-3">
<h3 id="org43e5d91"><a href="#org43e5d91">Name Starts With</a></h3>
<div class="outline-text-3" id="text-org43e5d91">
<div class="org-src-container">
<pre class="src src-sh">echo $Items \
    | jq -c '.[] | select(.name | startswith("This is"))'
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgba2e275" class="outline-2">
<h2 id="orgba2e275"><a href="#orgba2e275">AWS Resources with Tag</a></h2>
<div class="outline-text-2" id="text-orgba2e275">
</div>
<div id="outline-container-orgdc76ddd" class="outline-3">
<h3 id="orgdc76ddd"><a href="#orgdc76ddd">Use <code>aws --filter</code></a></h3>
<div class="outline-text-3" id="text-orgdc76ddd">
<p>
Some AWS commands provide a <code>--filter</code> option that allows filtering by tag.
</p>

<div class="org-src-container">
<pre class="src src-sh">aws ec2 describe-addresses \
    --filters "Name=tag:Name,Values=cfclrk"
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf7683d2" class="outline-2">
<h2 id="orgf7683d2"><a href="#orgf7683d2">Sorting</a></h2>
<div class="outline-text-2" id="text-orgf7683d2">
<div class="org-src-container">
<pre class="src src-sh">aws s3api list-objects-v2 \
    --bucket $BUCKET \
    --prefix "foo/bar" \
    | jq '.Contents | sort_by(.LastModified)'
</pre>
</div>

<p>
If you see an error like <code>Cannot index string with string</code>, it's probably
because you are not piping a proper list to it. For example:
</p>

<div class="org-src-container">
<pre class="src src-sh">cat $data | jq '.Stuff[] | sort_by(.Time)'  # Does not work

cat $data | jq '.Stuff | sort_by(.Time)'    # Works!
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfd726d8" class="outline-2">
<h2 id="orgfd726d8"><a href="#orgfd726d8">Stringify JSON</a></h2>
<div class="outline-text-2" id="text-orgfd726d8">
<pre class="example" id="org1fd3b5e">
{"message": "foo"}
</pre>

<div class="org-src-container">
<pre class="src src-sh">echo $message | jq '@json'
</pre>
</div>
</div>
</div>
</div>
</body>
</html>